app/controllers/yoyos_controller.rb

SELECT "yoyos".* FROM "yoyos"
---
	def index
		@yoyos = Yoyo.all

INSERT INTO "yoyos" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
	def create
		# name = params[:yoyo][:name]
		# url = params[:yoyo][:url]
		# Yoyo.create(name: name, url: url)
		@yoyo = Yoyo.create yoyo_params

SELECT  "yoyos".* FROM "yoyos" WHERE "yoyos"."id" = $1 LIMIT 1  [["id", 2]]
---
	def edit
        @yoyo = Yoyo.find(params[:id])

SELECT  "yoyos".* FROM "yoyos" WHERE "yoyos"."id" = $1 LIMIT 1  [["id", 2]]
---
   	def show
        @yoyo = Yoyo.find(params[:id])